---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.IndexPrimitive
source: html/b9718ac0-7194-1944-ce7f-a5c618f20ced.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexPrimitive

The base class for index buffer primitives.

## Syntax (C#)
```csharp
public class IndexPrimitive : IDisposable
```